Reports/УстановкаНормыКонструкторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>УстановкаНормыКонструкторов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзмененияКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСВнешнегоДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботеКонструктора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальнаяПауза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйПровал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлобальныйУспех</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДизайнерскийКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаДизайнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеПроверкиВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаДизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВнешнегоСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтвержденияВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаКонструктором</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВедущийКонструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоГотово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводствоОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизайнер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерПроектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерРабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗамерСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финдиректор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтадииКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СтадииКомплекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВторойУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПервыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТретийУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЧетвертыйУровеньВНаименовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыврдитьЧетвертыйВместоТретьего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченныйПоказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ожидание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭтап</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеЭтапы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыСтадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/УстановкаНормыКонструкторов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем РабочееВремя;

//ИнформацияОДата структура с полями: КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя
Функция ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата)
	
	ДанныеВозврата = Новый Структура("Норма, Факт, План, ОписаниеОбъектаТЗ", 0, 0, 0, "");
	
	ВремяПаузы 							= 0;
	ВремяОжидания 						= 0;
	ВремяОжиданияКонструктором 			= 0;
	ВремяПаузыВЧасах					= 0;
	ВремяОжиданияВЧасах 				= 0;
	ВремяОжиданияКонструкторомВЧасах 	= 0;
	
	ТаблицаВыводаОбъектаТЗ.Очистить(); 
	
	НайденыеСтроки = ТаблицаТайминга.НайтиСтроки(Отбор);
	
	МаксимальныйИндекс = НайденыеСтроки.Количество() - 1;
	
	ОжиданиеРаботы = Истина; 
	
	ПериодРаботы = Новый Структура("ДатаНачала, ДатаОкончания",); 
	
	Смещение = 0;

	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаТайминга = НайденыеСтроки[х - Смещение];
		
		Если СтрокаТайминга.ДатаНачала < Период.ДатаНачала И НЕ СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора Тогда
			Продолжить;	
		КонецЕсли;  
		
		Если х < МаксимальныйИндекс 
			И СтрокаТайминга.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
			
			СтрокаТаймингаСледующая 	= НайденыеСтроки[х + 1];
			
			Если  СтрокаТаймингаСледующая.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
				Смещение = Смещение + 1;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;  
		
		НС = ТаблицаВыводаОбъектаТЗ.Добавить();
		НС.ДатаСтрокой 			= СтрокаТайминга.ДатаСтрокой;
		НС.ДатаНачала 			= СтрокаТайминга.ДатаНачала;
		НС.Задача 				= СтрокаТайминга.Задача;
		НС.Норма 				= СтрокаТайминга.НормаВремени;
		НС.Стадия 				= СтрокаТайминга.Стадия;
		НС.СтадияНаименование	= СтрокаТайминга.СтадияНаименование;
		НС.ВРаботе 				= СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ВРаботеКонструктора;
		НС.ДругиеРаботы			= Ложь;
		Если НС.ВРаботе Тогда
			НС.СтруктураНорма	= Новый Структура("Период, Задача, НормаВремени", НС.ДатаНачала, СтрокаТайминга.Задача, НС.Норма);
		Иначе
		   	НС.СтруктураНорма	= Неопределено;
		КонецЕсли;
		
		Если х < МаксимальныйИндекс Тогда
			
			СтрокаТаймингаСледующая 	= НайденыеСтроки[х + 1];
			НС.Факт 					= Окр((СтрокаТаймингаСледующая.ДатаНачала - СтрокаТайминга.ДатаНачала) / СекундВСутках, 2);
			ПериодРаботы.ДатаНачала 	= СтрокаТайминга.ДатаНачала;
			ПериодРаботы.ДатаОкончания 	= СтрокаТаймингаСледующая.ДатаНачала;
			НС.ФактЧасы					= РегистрыСведений.ТаймингЗадач.РабочихЧасовВИнтервале(ПериодРаботы ,ИнформацияОДата);
			
			Если СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ПриостановкаКонструктором Тогда
			
				ВремяПаузы 			= ВремяПаузы 		+ НС.Факт;	
				ВремяПаузыВЧасах 	= ВремяПаузыВЧасах 	+ НС.ФактЧасы;	
			
			ИначеЕсли СтрокаТайминга.Состояние = Перечисления.СостоянияЗадач.ОжиданиеКонструктором Тогда
				
				ВремяОжидания 			= ВремяОжидания 		+ НС.Факт;	
				ВремяОжиданияВЧасах 	= ВремяОжиданияВЧасах 	+ НС.ФактЧасы;	
			
			ИначеЕсли СтрокаТайминга.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
				
				ВремяОжиданияКонструктором 			= ВремяОжиданияКонструктором 		+ НС.Факт;	
				ВремяОжиданияКонструкторомВЧасах 	= ВремяОжиданияКонструкторомВЧасах 	+ НС.ФактЧасы;	
				
				НС.СтадияНаименование	= "Другие работы";
				НС.ДругиеРаботы			= Истина;
			
			КонецЕсли;
			
		ИначеЕсли СтрокаТайминга.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ПодтверждениеВедущимКонструктором Тогда
			
			НС.СтадияНаименование	= "Другие работы";
			НС.ДругиеРаботы			= Истина;
			
		КонецЕсли; 
		
		Смещение = 0;

	КонецЦикла;
	
	МаксимальныйИндекс = ТаблицаВыводаОбъектаТЗ.Количество() - 1;
	
	Для х = 0 По МаксимальныйИндекс Цикл
		
		СтрокаВывода = ТаблицаВыводаОбъектаТЗ[МаксимальныйИндекс - х];
		
		Если СтрокаВывода.СтадияНаименование = "Другие работы" Тогда
			
			Если СтрокаВывода.ДатаНачала > Период.ДатаОкончания Тогда
				ТаблицаВыводаОбъектаТЗ.Удалить(СтрокаВывода);
			Иначе	
			    Прервать;
			КонецЕсли;
			
		Иначе	
			ТаблицаВыводаОбъектаТЗ.Удалить(СтрокаВывода);
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СоздатьТаблицуВывода()

	ОписаниеЧисла5_2 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеБулево		= Новый ОписаниеТипов("Булево");
	
	ТаблицаВыводаОбъектаТЗ = Новый ТаблицаЗначений;
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Стадия", 				Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтадияНаименование", 	Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаСтрокой", 			Новый ОписаниеТипов("Строка"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДатаНачала", 			Новый ОписаниеТипов("Дата"));
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Факт", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ФактЧасы", 			ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("План", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Норма", 				ОписаниеЧисла5_2);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("СтруктураНорма",		);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("Задача",				);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ВРаботе", 				ОписаниеБулево);
	ТаблицаВыводаОбъектаТЗ.Колонки.Добавить("ДругиеРаботы",			ОписаниеБулево);

	Возврат ТаблицаВыводаОбъектаТЗ;
	
КонецФункции // СоздатьТаблицуВывода()  ДругиеРаботы


Функция ПолучитьВыходныеДниВПериоде()
	
	ВыходныеДни = Новый Массив;
	
	Отбор = Новый Структура("РабочиеЧасы", 0);
	
	Для каждого х Из омДаты.ПолучитьРабочиеДни(Период.ДатаНачала, Период.ДатаОкончания, Ложь).НайтиСтроки(Отбор) Цикл
		ВыходныеДни.Добавить(х.Дата);
	КонецЦикла;
	
	Возврат ВыходныеДни;
	
КонецФункции // ПолучитьВыходныеДниВПериоде()

#Область Команды
	
&НаКлиенте
Процедура Обновить(Команда)
	СформироватьОтчет(РабочееВремя);
КонецПроцедуры

#КонецОбласти                  
#Область ИсполнениеКоманд
	
Процедура СформироватьОтчет(РабочееВремя)

	ПолеВывода.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Конструктор) Тогда
		Возврат;
	КонецЕсли;
	
	СекундВСутках = 3600 * 24;
	
	МенеджерОтчета = Отчеты.УстановкаНормыКонструкторов;
	
	Макет = МенеджерОтчета.ПолучитьМакет("Макет");
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	ТекущаяОбласть.Параметры.Заполнить(ЭтаФорма);
	ПолеВывода.Вывести(ТекущаяОбласть);
	ПолеВывода.ФиксацияСверху = ПолеВывода.ВысотаТаблицы;
	
	МенеджерРегистра = РегистрыСведений.ТаймингЗадач;
	
	ТекущаяОбласть 		= Макет.ПолучитьОбласть("Строка");
	ОбъектТЗОбласть 	= Макет.ПолучитьОбласть("ОбъектТЗ");
	
	ТаблицаТайминга 	= ПолучитьТаймингиЗадачКонструктор(Период,Конструктор).ТайминЗадач;
	
	ОбъектыТЗКонструктора = омТЧ_НаКлиентеСервере.КолонкуВМассив(ТаблицаТайминга, "ОбъектТЗ");
	
	ТаблицаТайминга.Сортировать("ОбъектТЗНаименование, ДатаНачала");
	Отбор = Новый Структура("ОбъектТЗ", );
	
	КоличестивоРабочихЧасовВДне = МенеджерРегистра.КоличествоРабочихЧасовСотрудника(РабочееВремя);
	ВыходныеДни					= ПолучитьВыходныеДниВПериоде();
	ИнформацияОДата = Новый Структура("КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя", КоличестивоРабочихЧасовВДне, ВыходныеДни, РабочееВремя);
	
	
	ТекущийОбъектТЗ = Неопределено;
	
	НормаИтого = 0;
	
	ТаблицаВыводаОбъектаТЗ = СоздатьТаблицуВывода();
	
	Для каждого СтрокаЗадач Из ТаблицаТайминга Цикл
		
		Если НЕ ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ Тогда
		
			Отбор.ОбъектТЗ = СтрокаЗадач.ОбъектТЗ;
			ЗаполнитьТаблицуВывода(ТаблицаВыводаОбъектаТЗ, ТаблицаТайминга, Отбор, СекундВСутках, Период, ИнформацияОДата);
			
			Если ТаблицаВыводаОбъектаТЗ.Количество() = 0 Тогда
				Продолжить;	
			КонецЕсли;
			
			ТекущийОбъектТЗ = СтрокаЗадач.ОбъектТЗ;	
		    ОбъектТЗОбласть.Параметры.Заполнить(СтрокаЗадач);
			ПолеВывода.Вывести(ОбъектТЗОбласть); 
			
			Вработе = Ложь;
			
			Для каждого х Из ТаблицаВыводаОбъектаТЗ Цикл
				
				Если х.Вработе Тогда
					ТекущаяОбласть.Параметры.Заполнить(х);
					//ПолеВывода.Вывести(ТекущаяОбласть);
					Вработе = Истина;
				ИначеЕсли х.ДругиеРаботы И Вработе Тогда
					//ДругиеРаботыОбласть.Параметры.Заполнить(х);
					ПолеВывода.Вывести(ТекущаяОбласть);
					//Иначе
					//	ТекущаяОбласть.Параметры.Заполнить(х);
					//	ПолеВывода.Вывести(ТекущаяОбласть); 
					
					НормаИтого = НормаИтого + х.Норма;
					Вработе = Ложь;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;
	
	ТекущаяОбласть = Макет.ПолучитьОбласть("Итого");
	ТекущаяОбласть.Параметры.Норма = НормаИтого;
	ПолеВывода.Вывести(ТекущаяОбласть); 
	
КонецПроцедуры 

#КонецОбласти


Функция ПолучитьТаймингиЗадачКонструктор(Период, Исполнитель) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаймингЗадач.Задача КАК Задача
		|ПОМЕСТИТЬ втЗадачи
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|ГДЕ
		|	ТаймингЗадач.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаймингЗадач.Задача
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаймингЗадач.Период КАК ДатаНачала,
		|	ТаймингЗадач.Задача КАК Задача,
		|	втЗадачи.Задача.Наименование КАК ЗадачаНаименование,
		|	ТаймингЗадач.Автор КАК Автор,
		|	ТаймингЗадач.Исполнитель КАК Исполнитель,
		|	ТаймингЗадач.Состояние КАК Состояние,
		|	ТаймингЗадач.Статус КАК Статус,
		|	ТаймингЗадач.ТипЗадачи КАК ТипЗадачи,
		|	ТаймингЗадач.НормаВремени КАК НормаВремени,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Наименование КАК ОбъектТЗНаименование,
		|	ТаймингЗадач.Задача.ОбъектТЗ КАК ОбъектТЗ,
		|	ТаймингЗадач.Задача.ОбъектТЗ.Проект КАК Проект,
		|	ТаймингЗадач.Исполнитель.Сотрудник КАК Сотрудник,
		|	ТаймингЗадач.Исполнитель.Сотрудник.НачалаРабочегоДня КАК НачалаРабочегоДня,
		|	ТаймингЗадач.Исполнитель.Сотрудник.ОкончаниеРабочегоДня КАК ОкончаниеРабочегоДня,
		|	ЗНАЧЕНИЕ(Справочник.СтадииКомплекта.ПустаяСсылка) КАК Стадия,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(14)) КАК ДатаСтрокой,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК СтадияНаименование,
		|	ЛОЖЬ КАК Ожидание,
		|	ЛОЖЬ КАК Доработка,
		|	0 КАК ПлановоеЗначение
		|ИЗ
		|	РегистрСведений.ТаймингЗадач КАК ТаймингЗадач
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадачи КАК втЗадачи
		|		ПО ТаймингЗадач.Задача = втЗадачи.Задача
		|ГДЕ
		|	(ТаймингЗадач.Исполнитель = &Исполнитель И ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ВРаботеКонструктора)) 
		|			ИЛИ ТаймингЗадач.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗадач.ОжиданиеПодтвержденияВедущимКонструктором)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектТЗНаименование,
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("Исполнитель", 	Исполнитель);
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	Период.ДатаОкончания);
	
	СтруктураВозврата = Новый Структура("ТайминЗадач, ПлановоеЗначение", );
	СтруктураВозврата.ТайминЗадач = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата.ТайминЗадач.Индексы.добавить("Задача");
	//
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПлановоеЗначениеПроектирования.Период КАК Период,
	//	|	ПлановоеЗначениеПроектирования.Задача КАК Задача,
	//	|	ПлановоеЗначениеПроектирования.Автор КАК Автор,
	//	|	ПлановоеЗначениеПроектирования.ДатаНачала КАК ДатаНачала,
	//	|	ПлановоеЗначениеПроектирования.ПланРазработкиВДнях КАК ПланРазработкиВДнях,
	//	|	ПлановоеЗначениеПроектирования.Комментарий КАК Комментарий
	//	|ИЗ
	//	|	РегистрСведений.ПлановоеЗначениеПроектирования КАК ПлановоеЗначениеПроектирования
	//	|ГДЕ
	//	|	ПлановоеЗначениеПроектирования.Задача В(&Задача)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Период";
	//
	//Запрос.УстановитьПараметр("Задача", СтруктураВозврата.ТайминЗадач.Выгрузитьколонку("Задача"));

	//ЗаполнитьПлановоеВремя(СтруктураВозврата.ТайминЗадач, Запрос.Выполнить().Выбрать());
	
	ЗаполнитьСтадииЗадачи(СтруктураВозврата.ТайминЗадач);
	
	Возврат СтруктураВозврата;
	
КонецФункции // ПолучитьТаймингиЗадач()  



Процедура ЗаполнитьСтадииЗадачи(ТайминЗадач)

	КэшСтадий = Новый ТаблицаЗначений;
	КэшСтадий.Колонки.Добавить("Стадия", 			Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	КэшСтадий.Колонки.Добавить("ТекущиеСостояние",	Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийСтатус", 	Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	КэшСтадий.Колонки.Добавить("ТекущийТипЗадачи", 	Новый ОписаниеТипов("ПеречислениеСсылка.ТипыЗадачКонструирования")); 
	
	Отбор = Новый Структура("ТекущиеСостояние, ТекущийСтатус, ТекущийТипЗадачи", );
	
	МассивСтадий = Новый Массив;
	
	Для каждого СтрокаТайминга Из ТайминЗадач Цикл
		
		Отбор.ТекущиеСостояние 	= СтрокаТайминга.Состояние;
		Отбор.ТекущийТипЗадачи 	= СтрокаТайминга.ТипЗадачи;
		Отбор.ТекущийСтатус 	= СтрокаТайминга.Статус;
		
		НайденыеСтроки = КэшСтадий.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда
		
			СтрокаТайминга.Стадия = омЗадачиПКДСервер.ПолучитьСтадиюКомплеткаНаОснованииПараметров(Отбор);		
			
			НС = КэшСтадий.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Отбор);
			НС.Стадия = СтрокаТайминга.Стадия; 
			
			МассивСтадий.Добавить(НС.Стадия);
		
		Иначе
		
			СтрокаТайминга.Стадия = НайденыеСтроки[0].Стадия;		
		
		КонецЕсли;
		
		СтрокаТайминга.ДатаСтрокой = Формат(СтрокаТайминга.ДатаНачала, "ДФ=dd.MM.yy") 
										+ " " + Формат(СтрокаТайминга.ДатаНачала, "ДФ=HH:mm");
		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтадииКомплекта.Ссылка КАК Стадия,
		|	СтадииКомплекта.Ожидание КАК Ожидание,
		|	СтадииКомплекта.Доработка КАК Доработка,
		|	СтадииКомплекта.ПолноеНаименование КАК СтадияНаименование
		|ИЗ
		|	Справочник.СтадииКомплекта КАК СтадииКомплекта
		|ГДЕ
		|	СтадииКомплекта.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСтадий);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Отбор = Новый Структура("Стадия", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Стадия = Выборка.Стадия;
		
		Для каждого х Из ТайминЗадач.НайтиСтроки(Отбор) Цикл
		
			ЗаполнитьЗначенияСвойств(х, Выборка);	
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ГлавныйКонструктор") Тогда
		
		Если Параметры.Свойство("Конструктор") Тогда
			
			Конструктор = Параметры.Конструктор;	
			
		КонецЕсли;
		
	Иначе
		
		Конструктор = ПараметрыСеанса.ТекущийПользователь;	
		
	КонецЕсли;
	
	Период.ДатаОкончания 	= КонецДня(ТекущаяДата());
	Период.ДатаНачала		= НачалоМесяца(ДобавитьМесяц(Период.ДатаОкончания, -1));
	
КонецПроцедуры
	
&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Конструктор) Тогда
		РабочееВремя = омСотрудники.ПолучитьРабочееВремяПользователи(Конструктор)[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если ЗначениеЗаполнено(Конструктор) Тогда
		РабочееВремя = омСотрудники.ПолучитьРабочееВремяПользователи(Конструктор)[0];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
	
		СтандартнаяОбработка = Ложь;
		
		
		СтруктураПараметры = Новый Структура("Расшифровка, ТекущаяОбласть", Расшифровка, Элемент.ТекущаяОбласть);
		
		ОписаниеОповещания = Новый ОписаниеОповещения("ПослеВводаНормы", ЭтаФорма, СтруктураПараметры);
		ПоказатьВводЧисла(ОписаниеОповещания, Расшифровка.НормаВремени, "Норма", 4, 1);
	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

&НаКлиенте
Процедура ПослеВводаНормы(Норма, ДополнительныеПараметры) Экспорт

	Если Норма = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Если ДополнительныеПараметры.Расшифровка.НормаВремени = Норма Тогда
		Возврат;
	КонецЕсли;
	
	//ДополнительныеПараметры.ТекущаяОбласть.Текст = Норма;
	//ДополнительныеПараметры.ТекущаяОбласть.Расшифровка.НормаВремени = Норма;
	//
	ЗписатьВРегистрНаСервере(ДополнительныеПараметры.Расшифровка);
	СформироватьОтчет(РабочееВремя);

КонецПроцедуры // ПослеВводаНормы()


&НаСервереБезКонтекста
Процедура ЗписатьВРегистрНаСервере(Расшифровка)


	МенеджерЗаписи = РегистрыСведений.ТаймингЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Расшифровка.Период;
	МенеджерЗаписи.Задача = Расшифровка.Задача;
	
	МенеджерЗаписи.Прочитать();

	МенеджерЗаписи.Период 		= Расшифровка.Период;
	МенеджерЗаписи.Задача 		= Расшифровка.Задача;
	МенеджерЗаписи.НормаВремени = Расшифровка.НормаВремени;
	
	МенеджерЗаписи.Записать();

КонецПроцедуры // ЗписатьВРегистрНаСервере(Расшифровка)
